app/Controllers/Player/Client/ClientController.php

    public function getUserData() {

        if ($this->session->has('user')) {
            $userId = $this->session->get('user')->id;

            $userData = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'