app/Controllers/Authentication/RegisterController.php

    private function createUser(array $data)
    {
        $userId = $this->userModel->insert($data);
        $user = $this->userModel->find($userId);
---
INSERT INTO `users` (`username`, `mail`, `password`) VALUES ('YeMMO', 'YeMMO@gmail.com', '$2y$10$0AULIwf9LpR8/URNFUBIWe0Rxgp98am.UPWYO/k3bRTGIm7/4iUxy')
SELECT *
FROM `users`
WHERE `users`.`id` = 2