app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    protected function setUserInView(): void
    {
        $userId = $this->session->get('user')->id;
        $user = $this->userModel->find($userId);